backup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-12 Tue 12:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>biobuntu backup</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Thomas Alexander Gerds Thomas A. Gerds" />
<link rel="stylesheet" type="text/css" href="https://publicifsv.sund.ku.dk/~tag/styles/practicals.css" />
</head>
<body>
<p class="course-menu"><a accesskey="h" href="README.html">Home</a>&nbsp;<a accesskey="p" href="https://github.com/tagteam">github</a></p><div id="content">
<h1 class="title">biobuntu backup</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge11e6fb">Backup all or some files</a>
<ul>
<li><a href="#orgca831f8">Philosophy</a></li>
<li><a href="#org1586cb0">Install unison on ubuntu</a></li>
<li><a href="#org8445e4d">Check Unison version on the server</a>
<ul>
<li><a href="#org73884c8">borel, gauss</a></li>
<li><a href="#orgfe33f90">doob, rasch</a></li>
</ul>
</li>
<li><a href="#orgb4182ef">Setup unison profile</a></li>
<li><a href="#org28976ac">Run unison</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge11e6fb" class="outline-2">
<h2 id="orge11e6fb">Backup all or some files</h2>
<div class="outline-text-2" id="text-orge11e6fb">
</div>
<div id="outline-container-orgca831f8" class="outline-3">
<h3 id="orgca831f8">Philosophy</h3>
<div class="outline-text-3" id="text-orgca831f8">
<p>
It is important that you backup your work. It may not be necessary to
backup all files in your home directory as this would include
auto-generated ubuntu system related files. A good approach is to save
work in folders and then add some selected files which are naturally
living in your home directory and do need backup (e.g., ~/.bashrc).
</p>

<p>
The backup philosophy here is <i>better save than sorry</i>. Hence, we use
the platform independent graphical interface <code>unison</code> to synchronize
our files. This allows us to check the <b>direction</b> of the proposed
changes before they are applied. For example, if the clock of the
server is not set correctly we could otherwise risk to overwrite our
precious work with an older version.
</p>
</div>
</div>

<div id="outline-container-org1586cb0" class="outline-3">
<h3 id="org1586cb0">Install unison on ubuntu</h3>
<div class="outline-text-3" id="text-org1586cb0">
<div class="org-src-container">
<pre class="src src-sh">sudo apt-get install --assume-yes liblablgtk-extras-ocaml-dev
sudo apt-get install --assume-yes unison unison-gtk unison-all unison-all-gtk
</pre>
</div>
</div>
</div>

<div id="outline-container-org8445e4d" class="outline-3">
<h3 id="org8445e4d">Check Unison version on the server</h3>
<div class="outline-text-3" id="text-org8445e4d">
<p>
The unison versions of the ubuntu machine needs to match the one on
the server:
</p>

<div class="org-src-container">
<pre class="src src-sh">/usr/local/bin/unison -version
</pre>
</div>
</div>

<div id="outline-container-org73884c8" class="outline-4">
<h4 id="org73884c8">borel, gauss</h4>
<div class="outline-text-4" id="text-org73884c8">
<p>
Should be fine. 
</p>
</div>
</div>

<div id="outline-container-orgfe33f90" class="outline-4">
<h4 id="orgfe33f90">doob, rasch</h4>
<div class="outline-text-4" id="text-orgfe33f90">
<p>
Unfortunately, the current version of unison on our redhat servers
(doob, rasch) is too low. Fortunately, there is a way &#x2026;
</p>

<ol class="org-ol">
<li>Create private bin (unless it exists)</li>
</ol>

<div class="org-src-container">
<pre class="src src-sh">ssh -X bio737@doob
mkdir ~/bin
</pre>
</div>

<ol class="org-ol">
<li value="2">set PATH so it includes user's private bin if it exists</li>
</ol>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">we are on the server side (e.g., doob) here</span>
 <span style="color: #a020f0;">if</span> [ -d ~/bin ]; <span style="color: #a020f0;">then</span>
   <span style="color: #a0522d;">PATH</span>=~/bin:<span style="color: #8b2252;">"${PATH}"</span>
 <span style="color: #a020f0;">fi</span>
</pre>
</div>

<ol class="org-ol">
<li value="3">copy binary</li>
</ol>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">we are still on the server side (e.g., doob) here</span>
cp /home/ifsv/grb615/bin/unison ~/bin/unison
chmod 751 ~/bin/unison <span style="color: #b22222;"># </span><span style="color: #b22222;">make it executable</span>
which unison <span style="color: #b22222;"># </span><span style="color: #b22222;">check if this now shows ~/bin/unison and NOT /usr/local/bin/unison</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb4182ef" class="outline-3">
<h3 id="orgb4182ef">Setup unison profile</h3>
<div class="outline-text-3" id="text-orgb4182ef">
<p>
The profiles are saved in the folder <code>~/.unison/</code> with extension
<code>.prf</code>.  The profiles are server specific but you can have an almost
identical copy for the servers, e.g., the two files
<code>~/.unison/doob.prf</code> and <code>~/.unison/gauss.prf</code> differ only by one
line. See the example below and the manual for syntax of this file:
</p>

<p>
<a href="http://www.cis.upenn.edu/~bcpierce/unison/download/releases/stable/unison-manual.html">http://www.cis.upenn.edu/~bcpierce/unison/download/releases/stable/unison-manual.html</a>
</p>

<p>
Example: contents of file <code>~/.unison/doob.prf</code>. Change <code>ubuntu-user</code> with your ubuntu user name and <code>bio737</code> with your
KU-id:
</p>

<pre class="example">
# Roots of the synchronization
root = /home/ubuntu-user/
root = ssh://bio737@doob//home/ifsv/bio737/

# files
path=.Rprofile
path=.bashrc
path=.unison/doob.prf
path=.gitconfig
path=.emacs

# folders
path=Desktop
path=research
path=bin

# don't synchronise everything (regexp)
ignore = Name *.exe
ignore = Name *.o 
ignore = Name *~
</pre>
</div>
</div>

<div id="outline-container-org28976ac" class="outline-3">
<h3 id="org28976ac">Run unison</h3>
<div class="outline-text-3" id="text-org28976ac">
<div class="org-src-container">
<pre class="src src-sh">unison-gtk -addnoversionno doob.prf
</pre>
</div>

<p>
Then check if all directions are plausible, resolve <code>?</code> (if any), and press <code>GO</code>. </p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 12 Mar 2019 by Thomas Alexander Gerds.
</div>
</body>
</html>
